package com.kingnod.etraining.common;

public enum NoticeType {
	
	
	//######## 用户组织 ################################################################
	/**
	 *  用户组成新变动通知
	 */
	O_UG_CHANGE,
	
	//######### 在线学习 #################################################################
	/**
	 * 在线学习学员组变动通知
	 */
	A_EL_CHANGE,
	/**
	 * 在线学学习员新增通知，向新增学员发布在线学习通知
	 */
	A_EL_NEW,
	/**
	 * 在线学习学员注销通知
	 */
	A_EL_REMOVED,
	
	//######### 在线学习 #################################################################
	/**
	 * 	在线考试学习学员组变动通知
	 */
	A_XN_CHANGE,
	/**
	 * 在线学学习员新增通知，向新增学员发布在线学习通知
	 */
	A_XN_NEW,
	/**
	 * 在线学习学员注销通知
	 */
	A_XN_REMOVED

}
